constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       16700;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       16800;
    }
    h2_inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       16900;
    }
    no_slip
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       17300;
    }
    emptiness
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1200;
        startFace       18100;
    }
)

// ************************************************************************* //
