system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0)     // 0
    (0 380 0)   // 1 
    (0 500 0)   // 2 
    (0 600 0)   // 3 
    (80 600 0)   // 4 
    (80 0 0)     // 5 
    (0 0 100)   // 6 
    (0 380 100) // 7
    (0 500 100) // 8
    (0 600 100) // 9
    (80 600 100) // 10
    (80 0 100)   // 11
    (80 500 100) // 12
    (80 500 0)   // 13
    (80 380 100) // 14
    (80 380 0)   // 15
    
);

blocks
(
    hex (0 1 7 6 5 15 14 11) (10 10 10) simpleGrading (1 1 1)
    hex (1 2 8 7 15 13 12 14) (40 10 10) simpleGrading (1 1 1)
    hex (2 3 9 8 13 4 10 12) (10 10 10) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (0 5 11 6)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (3 4 10 9)
        );
    }
    
    h2_inlet
    {
        type wall;
        faces
        (
            (1 2 8 7)
        );
    }
   
    no_slip
    {
        type wall;
        faces
        (
            (5 15 14 11)
	    (2 3 9 8)
            (0 1 7 6)
	    (15 13 12 14)
	    (13 4 10 12)
        );
    }

    emptiness
    {
        type empty;
        faces
        (
            (0 1 15 5)
	    (6 7 14 11)
	    (1 2 13 15)
	    (7 8 12 14)
	    (2 3 4 13)
	    (8 9 10 12)
        );
    }
	
);

mergePatchPairs
(
);

// ************************************************************************* //
