system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.5;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

scalar1
{
	type scalarTransport;
	functionObjectLibs ("libsolverFunctionObjects.so");

	enabled true;

	writeControl outputTime;
	
	log yes;

	nCorr 1;

	D 0;

	field S1;
}

functions
{

probes
{
type probes;
functionObjectLibs ("libsampling.so");
enabled true;
outputControl timeStep;
outputInterval 1;

fields
(
S1
);

probeLocations
(
(0 5 1)
(0.1 5 1)
(0.2 5 1)
(0.3 5 1)
(0.4 5 1)
(0.5 5 1)
(0.6 5 1)
(0.7 5 1)
(0.8 5 1)
);

}

}


// ************************************************************************* //
